
read_verilog ../CoreMarkTop.v
synth_ice40
write_verilog CoreMarkTop.syn.v


